package chapter3;
// Напишите цикл for, в котором перебирались бы значения от 1000 до О с шагом -2
public class ForHomework {
    public static void main(String[] args) {
        for (int i = 1000; i >= 0; i -= 2) {
            System.out.println(i);
        }
    }
}
