package chapter2;
/*
Напишите строку кода с вызовом метода println (), де этот результат выводится в виде одной строки:
Один
Два
Три
 */

public class OneString {
    public static void main(String[] args) {
        System.out.println("Один\nДва\nТри");
    }
}
